InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АкцизныеМаркиЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>АкцизныеМаркиЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыАкцизныхМарок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АкцизнаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АналитикаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикаХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыПересчетовТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтатусыПересчетовТоваров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриказНаПроведениеИнвентаризацииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПриказНаПроведениеИнвентаризацииТоваров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриказовНаПроведениеИнвентаризацийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ххх_ИдЦентр</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновкиДанных</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОтбораТоваровИнвентаризации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОтбораТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/TSD/Ext/Module.bsl
Функция FullLoad()
	
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("Алко",справочники.Номенклатура.НайтиПоНаименованию("Алкоголь"));
	Запрос.Текст="ВЫБРАТЬ
	             |	НоменклатураНаша.ххх_ИдЦентр КАК ххх_ИдЦентр,
	             |	ЕСТЬNULL(НоменклатураНаша.ххх_НаименованиеЦенник, НоменклатураНаша.Наименование) КАК Наименование,
	             |	Штрихкоды.Штрихкод КАК Штрихкод
	             |ИЗ
	             |	Справочник.Номенклатура КАК НоменклатураНаша
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	             |		ПО НоменклатураНаша.Ссылка = Штрихкоды.Владелец
	             |ГДЕ
	             |	НЕ НоменклатураНаша.ЭтоГруппа
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ЕСТЬNULL(НоменклатураНаша.ххх_НаименованиеЦенник, НоменклатураНаша.Наименование),
	             |	Штрихкоды.Штрихкод,
	             |	НоменклатураНаша.ххх_ИдЦентр
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ххх_ИдЦентр";


	рут=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","rootType"));
	номенклатуры=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","nomenclaturesType"));
	рут.nomenclatures=номенклатуры;
	
	

	
	
	выборка=Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		
		Если не ЗначениеЗаполнено(выборка.ххх_ИдЦентр) тогда продолжить конецесли;
		номенклатура=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","nomenclatureType"));	
		номенклатуры.nomenclature.Добавить(номенклатура);
		номенклатура.id=(выборка.ххх_ИдЦентр);
		номенклатура.name=выборка.Наименование;
		номенклатура.barcode=выборка.Штрихкод;
		
	КонецЦикла;

	
	
	
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("Алко",справочники.Номенклатура.НайтиПоНаименованию("Алкоголь"));
	Запрос.Текст="ВЫБРАТЬ
	             |	СоответствиеНоменклатурыЕГАИС.Номенклатура.ххх_НаименованиеЦенник КАК Наименвоание,
	             |	СоответствиеНоменклатурыЕГАИС.Номенклатура.ххх_ИдЦентр КАК ххх_ИдЦентр,
	             |	АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода КАК АкцизнаяМарка
	             |ИЗ
	             |	РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	             |		ПО АкцизныеМаркиЕГАИС.АлкогольнаяПродукция = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	             |ГДЕ
	             |	НЕ АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода ЕСТЬ NULL
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	СоответствиеНоменклатурыЕГАИС.Номенклатура.ххх_НаименованиеЦенник,
	             |	СоответствиеНоменклатурыЕГАИС.Номенклатура.ххх_ИдЦентр,
	             |	АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода";


	//рут=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","rootType"));
	акцизи=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","marksType"));
	рут.marks=акцизи;
	
	

	
	
	выборка=Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		
		Если не ЗначениеЗаполнено(выборка.ххх_ИдЦентр) тогда продолжить конецесли;
		акциза=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","markType"));	
		акцизи.mark.Добавить(акциза);
		акциза.id=выборка.ххх_ИдЦентр;
		акциза.name=выборка.Наименвоание;
		акциза.mark=выборка.АкцизнаяМарка;
		
	КонецЦикла;

	возврат рут;


КонецФункции


Функция GetInventoryById(id)
	
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("ид",id);
	Запрос.Текст="ВЫБРАТЬ
	             |	ПриказНаПроведениеИнвентаризацииТоваров.НастройкиКомпоновкиДанных КАК НастройкиКомпоновкиДанных
	             |ИЗ
	             |	Документ.ПриказНаПроведениеИнвентаризацииТоваров КАК ПриказНаПроведениеИнвентаризацииТоваров
	             |ГДЕ
	             |	ПриказНаПроведениеИнвентаризацииТоваров.ххх_ИдЦентр = &ид
	             |	И ПриказНаПроведениеИнвентаризацииТоваров.Проведен";
	
	
	выборка=Запрос.Выполнить().Выбрать();
	
	Если не выборка.Следующий() Тогда
		ВызватьИсключение "Такого приказа на инвентаризацию не существует!";
	КонецЕсли;
	
	
	МассивГрупп=новый массив;
	ПолеКомпоновки=Новый ПолеКомпоновкиДанных("Номенклатура");

	НастройкиКомпоновкиДанных=выборка.НастройкиКомпоновкиДанных.получить();			
	Для каждого эл из НастройкиКомпоновкиДанных.Отбор.Элементы Цикл
		Если эл.ЛевоеЗначение=ПолеКомпоновки Тогда
			Если ТипЗнч(эл.ПравоеЗначение)=Тип("СправочникСсылка.Номенклатура") Тогда
			Иначе
				Для каждого группа из эл.ПравоеЗначение Цикл
					МассивГрупп.Добавить(группа.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если МассивГрупп.Количество()=0 Тогда
		ВызватьИсключение "В приказе не выбранны группы товаров!";
	КонецЕсли;

	рут=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","rootType"));
	Инвентаризации=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","inventorysType"));
	рут.inventorys=Инвентаризации;
	Инвентаризация=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","inventoryType"));
	Инвентаризации.inventory.добавить(Инвентаризация);
	Инвентаризация.id=id;
	тело=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","inventoryBodyType"));
	Инвентаризация.body=тело;
	
	Запрос.УстановитьПараметр("массивГрупп",массивГрупп);
	Запрос.Текст="ВЫБРАТЬ
	             |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	             |	ТоварыНаСкладахОстатки.Номенклатура.ххх_ИдЦентр КАК ид
	             |ИЗ
	             |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В ИЕРАРХИИ (&МассивГрупп)) КАК ТоварыНаСкладахОстатки
	             |ГДЕ
	             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0";
	
	выборка=запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		строка=ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://NewExchangeTSD","inventoryBodyRaw"));
		тело.inventoryBodyRaw.Добавить(строка);
		строка.id=Выборка.ид;
		строка.count=Выборка.Остаток;
	КонецЦикла;
	
	возврат рут;	
	
	
КонецФункции


Функция LoadInventorysToServer(root)
	
	Для каждого инвентаризация из root.inventorys.inventory цикл	
		
		ПриказНаПроведениеИнвентаризацииТоваров=Документы.ПриказНаПроведениеИнвентаризацииТоваров.НайтиПоРеквизиту("ххх_ИдЦентр",Число(инвентаризация.Id));
		Док=Документы.ПересчетТоваров.НайтиПоРеквизиту("ДокументОснование",ПриказНаПроведениеИнвентаризацииТоваров);
		Если ЗначениеЗаполнено(док) тогда
			док=док.получитьОбъект();
			док.установитьПометкуУдаления(Ложь);
		Иначе
			док=Документы.ПересчетТоваров.СоздатьДокумент();
		КонецЕСли;
		
		Док.ДокументОснование=ПриказНаПроведениеИнвентаризацииТоваров;
		Док.ОтборПересчетаТоваров=ПриказНаПроведениеИнвентаризацииТоваров.НастройкиКомпоновкиДанных;
		Док.Магазин=ПриказНаПроведениеИнвентаризацииТоваров.Магазин;
		Док.Организация=ПриказНаПроведениеИнвентаризацииТоваров.Организация;
		Док.Склад=ПриказНаПроведениеИнвентаризацииТоваров.Склад;
		Док.Статус=Перечисления.СтатусыПересчетовТоваров.ВРаботе;
		Док.Дата=ПриказНаПроведениеИнвентаризацииТоваров.Дата;
		
		//Док.Ответственный=ПараметрыСеанса.АвторизованныйПользователь;
		Док.АкцизныеМарки.Очистить();
		Док.Товары.Очистить();
		
		ТчПоиска=Новый ТаблицаЗначений;
		ТчПоиска.Колонки.Добавить("ххх_ИдЦентр",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(150)));
		ТчПоиска.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,4)));
		Для каждого row из инвентаризация.Body.inventoryBodyRaw Цикл
			стр=ТчПоиска.Добавить();
			стр.ххх_ИдЦентр=row.Id;
			стр.Количество=row.Count;
		КонецЦикла;     
		
		попытка
			мас=Новый массив;
			Для каждого rowAlco из инвентаризация.marks.inventoryMarksRaw Цикл
				стр=Док.АкцизныеМарки.Добавить();
				стр.АкцизнаяМарка=rowAlco.mark;
				стр.СтрокаСвязи=rowAlco.uid;
			КонецЦикла;
		Исключение
		КонецПопытки;

		
		Запрос=Новый запрос;
		запрос.УстановитьПараметр("тч",ТчПоиска);
		Запрос.Текст="ВЫБРАТЬ
		             |	тч.ххх_ИдЦентр КАК ххх_ИдЦентр,
		             |	тч.Количество КАК Количество
		             |ПОМЕСТИТЬ тч
		             |ИЗ
		             |	&тч КАК тч
		             |
		             |ИНДЕКСИРОВАТЬ ПО
		             |	ххх_ИдЦентр
		             |;
		             |
		             |////////////////////////////////////////////////////////////////////////////////
		             |ВЫБРАТЬ
		             |	Номенклатура.Ссылка КАК Ссылка,
		             |	тч.Количество КАК Количество
		             |ИЗ
		             |	тч КАК тч
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		             |		ПО тч.ххх_ИдЦентр = Номенклатура.ххх_ИдЦентр
		             |ГДЕ
		             |	НЕ Номенклатура.ЭтоГруппа";
		Выборка=Запрос.Выполнить().Выбрать();
		
		Пока выборка.Следующий() Цикл
			стр=Док.Товары.Добавить();
			стр.Номенклатура=выборка.Ссылка;
			стр.КоличествоУпаковокФакт=выборка.Количество;
			стр.КоличествоФакт=выборка.Количество;
		КонецЦикла;
		
		док.записать();

		
		
	КонецЦикла;
	
	возврат "1";	
КонецФункции
